content-org/non_personal_lists.org
#+hugo_section: public_lists

* Challenges and Sports
:PROPERTIES:
:EXPORT_FILE_NAME: challenges_sports
:END:
** Online
- [[https://projecteuler.net/][About - Project Euler]]
- [[http://eudyptula-challenge.org/][The Eudyptula Challenge]]
- [[https://cryptopals.com/][The Cryptopals Crypto Challenges]]
- [[https://mightybyte.github.io/monad-challenges/][The Monad Challenges]]
- [[https://deadlockempire.github.io/#T1-Interface][The Deadlock Empire]]
- [[https://adventofcode.com/][Advent of Code 2021]]
- [[https://en.wikipedia.org/wiki/The_Computer_Language_Benchmarks_Game][The Computer Language Benchmarks Game - Wikipedia]]
- [[https://www.rosettacode.org/wiki/Rosetta_Code][Rosetta Code]]
- [[https://mystery.knightlab.com/][The SQL Murder Mystery]]
- [[https://jimbly.github.io/regex-crossword/][RegEx Crossword]]
- [[https://mysteries.wizardzines.com/50ms-request.html][The Case of the 50ms request]]
- [[https://github.com/NaNoGenMo/2021][NaNoGenMo/2021: National Novel Generation Month, 2021 edition.]]
- [[https://en.wikipedia.org/wiki/The_Game_(mind_game)][The Game (mind game) - Wikipedia]]
- [[https://neal.fun/absurd-trolley-problems/][Absurd Trolley Problems]]
- [[http://geekwagon.net/projects/xkcd1190/][xkcd Time - at your own pace]]
- [[https://onehouronelife.com/][One Hour One Life]]
** Games
| Name         | Description                                                                         |
| [[https://github.com/JaCzekanski/Avocado][Avocado]]      | 🥑 PlayStation 1 emulator                                                           |
| [[https://github.com/skatiyar/pacman][pacman]]       | Classic pacman with procedurally generated infinite vertical maze.                  |
| [[https://github.com/tom-james-watson/wikitrivia][wikitrivia]]   | Wikidata as a trivia card game.                                                     |
| [[https://github.com/jifunks/botany][botany]]       | command line virtual plant buddy                                                    |
| [[https://github.com/fogleman/nes][nes]]          | NES emulator written in Go.                                                         |
| [[https://github.com/ncase/trust][trust]]        | An interactive guide to the game theory of cooperation                              |
| [[https://github.com/xraymemory/bookstory-en][bookstory-en]] | English translation of BookStory                                                    |
| [[https://github.com/veltman/clmystery][clmystery]]    | A command-line murder mystery                                                       |
| [[https://github.com/spieglt/nestur][nestur]]       | The NES (emulator) you left outside in the rain but let dry and still kind of works |
| [[https://github.com/ruffle-rs/ruffle][ruffle]]       | A Flash Player emulator written in Rust                                             |
| [[https://github.com/yuzu-emu/yuzu][yuzu]]         | Nintendo Switch Emulator                                                            |
| [[https://github.com/kristoff-it/bork][bork]]         | A TUI chat client tailored for livecoding on Twitch.                                |

** Offline
- [[https://youtu.be/nKy_pmuB9-g?list=FLamZIcLz5_b2rJfnEtAFhyQ][Speedcabling Championship - YouTube]]
