content/public_lists/challenges_sports.md
+++
title = "Challenges and Sports"
author = ["Hrishikesh Barman"]
draft = false
+++

## Online {#online}

-   [About - Project Euler](https://projecteuler.net/)
-   [The Eudyptula Challenge](http://eudyptula-challenge.org/)
-   [The Cryptopals Crypto Challenges](https://cryptopals.com/)
-   [The Monad Challenges](https://mightybyte.github.io/monad-challenges/)
-   [The Deadlock Empire](https://deadlockempire.github.io/#T1-Interface)
-   [Advent of Code 2021](https://adventofcode.com/)
-   [The Computer Language Benchmarks Game - Wikipedia](https://en.wikipedia.org/wiki/The_Computer_Language_Benchmarks_Game)
-   [Rosetta Code](https://www.rosettacode.org/wiki/Rosetta_Code)
-   [The SQL Murder Mystery](https://mystery.knightlab.com/)
-   [RegEx Crossword](https://jimbly.github.io/regex-crossword/)
-   [The Case of the 50ms request](https://mysteries.wizardzines.com/50ms-request.html)
-   [NaNoGenMo/2021: National Novel Generation Month, 2021 edition.](https://github.com/NaNoGenMo/2021)
-   [The Game (mind game) - Wikipedia](https://en.wikipedia.org/wiki/The_Game_(mind_game))
-   [Absurd Trolley Problems](https://neal.fun/absurd-trolley-problems/)
-   [xkcd Time - at your own pace](http://geekwagon.net/projects/xkcd1190/)
-   [One Hour One Life](https://onehouronelife.com/)


## Games {#games}

| Name                                                         | Description                                                                         |
|--------------------------------------------------------------|-------------------------------------------------------------------------------------|
| [Avocado](https://github.com/JaCzekanski/Avocado)            | 🥑 PlayStation 1 emulator                                                           |
| [pacman](https://github.com/skatiyar/pacman)                 | Classic pacman with procedurally generated infinite vertical maze.                  |
| [wikitrivia](https://github.com/tom-james-watson/wikitrivia) | Wikidata as a trivia card game.                                                     |
| [botany](https://github.com/jifunks/botany)                  | command line virtual plant buddy                                                    |
| [nes](https://github.com/fogleman/nes)                       | NES emulator written in Go.                                                         |
| [trust](https://github.com/ncase/trust)                      | An interactive guide to the game theory of cooperation                              |
| [bookstory-en](https://github.com/xraymemory/bookstory-en)   | English translation of BookStory                                                    |
| [clmystery](https://github.com/veltman/clmystery)            | A command-line murder mystery                                                       |
| [nestur](https://github.com/spieglt/nestur)                  | The NES (emulator) you left outside in the rain but let dry and still kind of works |
| [ruffle](https://github.com/ruffle-rs/ruffle)                | A Flash Player emulator written in Rust                                             |
| [yuzu](https://github.com/yuzu-emu/yuzu)                     | Nintendo Switch Emulator                                                            |
| [bork](https://github.com/kristoff-it/bork)                  | A TUI chat client tailored for livecoding on Twitch.                                |


## Offline {#offline}

-   [Speedcabling Championship - YouTube](https://youtu.be/nKy_pmuB9-g?list=FLamZIcLz5_b2rJfnEtAFhyQ)
